#########################################################################
# File Name     : 9_正则表达式.sh
# Author        : miaohaiwei
# mail          : 748750443@qq.com
# Created Time  : 2019年03月17日 星期日 19时14分03秒
#########################################################################

#!/bin/bash


# * 多个或0个任意字符
cat /etc/passwd | grep 'r*t'

# .匹配任意一个字符
cat /etc/passwd | grep 'r..t'
echo "---------------------------"
#\{n,m\} 匹配前面字符n到m次
echo "root" | grep 'o\{2,3\}t'
echo "rooot" | grep 'o\{2,3\}'

# ^root 以root开始的
echo "--------------------"
cat /etc/passwd | grep '^root'

# $ 以什么结尾的
echo "--------------------"
cat /etc/passwd | grep '$r.*h'

#[]判断方括号中任一字符
echo "----------------------"
echo "14812345678" | grep "^1[38][0-9]\{9\}"#判断电话号码是否合法 1开头3或8 然后后面9个数字

#转义字符\

#\< \>是左边界和右边界
#\<hello\>会精确匹配hello，但是不理解与^hello$有什么区别


#上面8个是常见的正则符号，还有一些见书上

#还有一些扩展的正则表达式
#\< \>是左边界和右边界
#\<hello\>会精确匹配hello，但是不理解与^hello$有什么区别
 
#上面8个是常见的正则符号，还有一些见书上
 
#还有一些扩展的正则表达式 要用egrep记性                                                                                                                                              
 
#?匹配前一个字符0次或1次
#+ 匹配前一个字符1词以上
#| 或，罗列多种可能
echo "0123-12345678" | egrep '^0[0-9]\{3\}-[0-9]|{8\} |^0[0-9]\{3\}-[0-9]|{8\}' #判断-前面是3位或者4位的电话合理性


