#########################################################################
# File Name     : a8_CDPATH_一键进入长目录.sh
# Author        : miaohaiwei
# mail          : 748750443@qq.com
# Created Time  : 2019年03月20日 星期三 14时42分53秒
#########################################################################

#!/bin/bash

#-----CDPATH------------------
#例如我们进/etc/sysconfig/network-scripts/很烦，
#我们可以CDPATH="/etc/sysconfig/"
#这样我们在任何目录 cd network-scripts 都可以进去
#他会先查询当前目录有没有network-scripts，然后再查询CDPATH，真的好使

#-----PATH------------------
#PATH保存这可执行文件检查路径以:分割

#-----PS1------------------
#PS1保存shell交互显示，默认为[\u@\h \W]$ 可以通过改变这个变量来定制交互界面




